"""
멘토세션5 - 코딩테스트 관련 역량

- 실무 vs 코딩테스트
    - 실무 역량
        - 기본 구현 능력
            - 기초 문법 활용
            - 로직 구현
            - OOP, FP
            - 디버깅
        - 코드 최적화
            - 성능 최적화
            - 리팩토링
        - 라이브러리 활용
        - 프레임워크 이해
        - 테스트 및 품질 관리

    - 코딩테스트 관련 역량
        - 기본 구현 능력
            - 기초 문법 활용
            - 로직 구현
        - 코드 최적화
            - 성능 최적화
        - 자료구조 구현
            - 라이브러리 활용
            - 세부 구현 및 이해
        - 알고리즘 구현
            - 단순 구현 및 적용
            - 변형 및 개선

    - 코딩테스트 연량의 파악과 발전의 지름길
        1. 코딩 테스트 응시하기
        2. 시간 제한을 두고 문제 풀기
        3. 동료와 토론하기
"""